public class Main {
    public static void main(String[] args) {
        int Price = 10_000;
        int bonus = Price / 20;
        System.out.println("Number of bonuses: " + bonus);
    }


    // Объявляете переменные для входных данных и
    // параметров программы: одну для хранения
    // стоимости билета, другую для хранения количества
    // рублей для одной бонусной мили

    // Рассчитываете количество бонусных миль, используя
    // значения заведённых переменных. Ответ сохраняете в
    // новую переменную и выводите на экран
}